GHB2/src/Documents/гхб_СпискиДоступаНаЛокацию/гхб_СпискиДоступаНаЛокацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_СпискиДоступаНаЛокацию</name>
  <registerRecords>InformationRegister.гхб_СпискиДоступаНаЛокацию</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеренесеноИзБазыРесурсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокументаБазыРесурсов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Дивизион</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Функция</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритичноНеобходимоРаботатьВОфисе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Гость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГостьОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата4</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата5</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата6</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата7</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПеренесенныеИзБазыРесурсов</name>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_РаботникиОрганизацийБазХолдинга/гхб_РаботникиОрганизацийБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаботникиОрганизацийБазХолдинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.гхб_ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>ПозицияШтатногоРасписания</name>
    <type>
      <types>CatalogRef.гхб_ПозицииШтатногоРасписанияБазХолдинга</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияСрочногоТрудовогоДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.гхб_ЦФО</types>
    </type>
  </resources>
  <attributes>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетныйКодПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДивизиона</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ШтатноеРасписаниеБазХолдинга/гхб_ШтатноеРасписаниеБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ШтатноеРасписаниеБазХолдинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КритичнаяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БюджетныйКодПозиции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БюджетныйКодПозицииРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньДолжности</name>
    <type>
      <types>EnumRef.гхб_УровниДолжностей</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакПозиции</name>
    <type>
      <types>EnumRef.гхб_ПризнакиПозиций</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.гхб_ПозицииШтатногоРасписанияБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ПричиныИзмененияСостояния/гхб_ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Декрет</name>
    <comment>Декрет</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратИзДекрет</name>
    <comment>Возврат из декрет</comment>
  </enumValues>
</mdclass:Enum>

GHB2/src/Enums/гхб_ВидыЗанятостиВОрганизации/гхб_ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_СпискиДоступаНаЛокацию/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИДоступность();
	УстановитьНазванияКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИДоступность()
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьНаСервере()
	
	Элементы.ПеренесеноИзБазыРесурсов.Видимость = Объект.ПеренесеноИзБазыРесурсов;
	ЭтотОбъект.ТолькоПросмотр = Объект.ПеренесеноИзБазыРесурсов;
	
	Элементы.ГруппаПериод.Видимость = НЕ Объект.ПеренесеноИзБазыРесурсов;
	Элементы.Данные.Видимость = НЕ Объект.ПеренесеноИзБазыРесурсов;
	Элементы.ДанныеПеренесенныеИзБазыРесурсов.Видимость = Объект.ПеренесеноИзБазыРесурсов;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И (Объект.ДатаНачала < _ТекущаяДата) Тогда
		
		Элементы.ГруппаПериод.ТолькоПросмотр = Истина;
		//Элементы.ДанныеЛокация.ТолькоПросмотр = Истина;
		//Элементы.ДанныеГость.ТолькоПросмотр = Истина;
		//Элементы.ДанныеСотрудник.ТолькоПросмотр = Истина;
		
		Для ф = 1 По 7 Цикл
		
			Элементы["ДанныеДата" + ф].ТолькоПросмотр = 
				гхб_ОбщегоНазначенияКлиентСервер.ДобавитьДеньКДате(Объект.ДатаНачала, ф - 1) < _ТекущаяДата;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНазванияКолонок()

	Для ф = 1 По 7 Цикл
		
		Элементы["ДанныеДата" + ф].Заголовок = Формат(
			гхб_ОбщегоНазначенияКлиентСервер.ДобавитьДеньКДате(Объект.ДатаНачала, ф - 1), "ДФ=dd.MM");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = гхб_ОбщегоНазначенияКлиентСервер.ДобавитьДеньКДате(НачалоНедели(ТекущаяДатаСеанса()), 7);
		Объект.ДатаОкончания = ВернутьДатуОкончанияПоДатеНачала(Объект.ДатаНачала);
	КонецЕсли;
	
	УстановитьВидимостьИДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВернутьДатуОкончанияПоДатеНачала(_ДатаНачала)
	
	Возврат НачалоДня(КонецНедели(_ДатаНачала));
	
КонецФункции

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Объект.ДатаОкончания = ВернутьДатуОкончанияПоДатеНачала(Объект.ДатаНачала);
	УстановитьНазванияКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПередУдалением(Элемент, Отказ)
	
	Отказ = (Объект.ДатаНачала < _ТекущаяДата);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСотрудникПриИзменении(Элемент)
	
	ТД = Элементы.Данные.ТекущиеДанные;
	
	Если НЕ (ТД = Неопределено) И ЗначениеЗаполнено(ТД.Сотрудник) Тогда
		_ДанныеСотрудника = ПолучитьДанныеСотрудникаПоОсновномуМестуРаботы(ТД.Сотрудник);
		ЗаполнитьЗначенияСвойств(ТД, _ДанныеСотрудника);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудникаПоОсновномуМестуРаботы(_ФЛ)
	
	_Структура = Новый Структура("Дивизион, Функция", Справочники.гхб_Дивизионы.ПустаяСсылка(), Справочники.гхб_Дивизионы.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(_ФЛ) Тогда
		
		ЗапросКадры = Новый Запрос();
		ЗапросКадры.Текст = "ВЫБРАТЬ
		                    |	гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.Дивизион КАК Дивизион,
		                    |	гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ГруппаДивизиона КАК Функция
		                    |ИЗ
		                    |	РегистрСведений.гхб_РаботникиОрганизацийБазХолдинга.СрезПоследних(, Сотрудник.ФизЛицоБазыХолдинга.ФизЛицоТекущейБазы = &ФизЛицоТекущейБазы) КАК гхб_РаботникиОрганизацийБазХолдингаСрезПоследних
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ШтатноеРасписаниеБазХолдинга.СрезПоследних КАК гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних
		                    |		ПО гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.БазаХолдинга = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.БазаХолдинга
		                    |			И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.Организация = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.Организация
		                    |			И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ПодразделениеОрганизации = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.ПодразделениеОрганизации
		                    |			И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ПозицияШтатногоРасписания = гхб_ШтатноеРасписаниеБазХолдингаСрезПоследних.Позиция
		                    |ГДЕ
		                    |	гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.гхб_ПричиныИзмененияСостояния.Увольнение)
		                    |	И гхб_РаботникиОрганизацийБазХолдингаСрезПоследних.Сотрудник.ВидЗанятости В(&ВидЗанятости)";
		
		_СписокВидовЗанятости = Новый СписокЗначений();
		_СписокВидовЗанятости.Добавить(Перечисления.гхб_ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
		_СписокВидовЗанятости.Добавить(Перечисления.гхб_ВидыЗанятостиВОрганизации.Совместительство);

		ЗапросКадры.УстановитьПараметр("ВидЗанятости", _СписокВидовЗанятости);
		ЗапросКадры.УстановитьПараметр("ФизЛицоТекущейБазы", _ФЛ);
		
		Выборка = ЗапросКадры.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			_Структура.Дивизион = Выборка.Дивизион;
			_Структура.Функция = Выборка.Функция;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _Структура;
	
КонецФункции

&НаКлиенте
Процедура ДанныеПриАктивизацииСтроки(Элемент)
	
	УстановитьОграничениеВыбора(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеВыбора(_ОчищатьДанные)
	
	ТД = Элементы.Данные.ТекущиеДанные;
	
	Если НЕ (ТД = Неопределено) Тогда
		Если ТД.Гость Тогда
			Элементы.ДанныеСотрудник.ОграничениеТипа = Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(100));
			Элементы.ДанныеСотрудник.КнопкаВыбора = Ложь;
			
			Если _ОчищатьДанные Тогда
				ТД.Сотрудник = "";
			КонецЕсли;
		Иначе
			Элементы.ДанныеСотрудник.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.гхб_ФизическиеЛица");
			Элементы.ДанныеСотрудник.КнопкаВыбора = Истина;
			
			Если _ОчищатьДанные Тогда
				ТД.Сотрудник = ПредопределенноеЗначение("Справочник.гхб_ФизическиеЛица.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеГостьПриИзменении(Элемент)
	
	УстановитьОграничениеВыбора(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеГостьОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Сообщить("1");
	
КонецПроцедуры
